<?php defined('EXT') OR die('No direct script access allowed');

############################################################################
#   Файл настроек для коммандной строки (php foton)
############################################################################

require_once 'config' . CONFIG_EXT;


//--------------------------------------------------------------------------
//   Router settings
//--------------------------------------------------------------------------

$config->router->rules = array();
$config->router->default_component = 'console';


//--------------------------------------------------------------------------
//   Loader settings
//--------------------------------------------------------------------------

$config->load->autoload = array(
	'config'    => array(),
	'library'   => array(),
	'model'     => array(),
	'extension' => array('console'),
	'component' => array(),
);

//--------------------------------------------------------------------------
